Repository: easytransac/EasyTransac-WooCommerce
Catalog: i18n/languages/easytransac_woocommerce-*.po
Languages: fr_fr

source: Billing phone is not valid phone number.
fr_fr: Le numéro de téléphone de facturation n’est pas valide.

source: What is EasyTransac?
fr_fr: Qu'est ce qu'EasyTransac ?

source: Empty Response
fr_fr: Réponse vide

source: EasyTransac support full refund only.
fr_fr: EasyTransac ne supporte que les remboursements complets.

source: Enable/Disable debug mode
fr_fr: Activer/Désactiver le mode de debug

source: Enable One Click payments
fr_fr: Activer les paiements One Click

source: Enable/Disable One Click payments
fr_fr: Activer/Désactiver les paiemnts One Click

source: Payment failed:
fr_fr: Le paiement à échoué :

source: Notification URL
fr_fr: URL de Notification

source: Payment Gateway for EasyTransac. Create your account on <a href="https://www.easytransac.com">www.easytransac.com</a> to get your application key (API key) by following the steps on <a href="https://fr.wordpress.org/plugins/easytransac/installation/">the installation guide</a> and configure this plugin <a href="../wp-admin/admin.php?page=wc-settings&tab=checkout&section=easytransacgateway">here.</a> <strong>EasyTransac need Woocomerce.</strong>
fr_fr: Plateforme de paiement pour EasyTransac. Créez votre compte sur <a href="https://www.easytransac.com">www.easytransac.com</a> pour obtenir votre clé d'API en suivant les étapes du <a href="https://fr.wordpress.org/plugins/easytransac/installation/">guide d'installation</a> et configurer le plugin <a href="../wp-admin/admin.php?page=wc-settings&tab=checkout&section=easytransacgateway">ici.</a> <strong>EasyTransac à besoin de WooCommerce.</strong>

source: EasyTransac online payment service
fr_fr: EasyTransac, service de paiement en ligne

source: EasyTransac for WooCommerce
fr_fr: EasyTransac pour WooCommerce

source: Payment error:
fr_fr: Erreur de paiement :

source: Enable 3D Secure
fr_fr: Activer le 3D Secure

source: Enable/Disable 3D Secure payments
fr_fr: Activer/Désactiver les paiements 3D Secure

source: Your EasyTransac application API Key.
fr_fr: Votre clé d'API EasyTransac.

source: API Key
fr_fr: Clé d'API

source: This controls the title which the user sees during checkout.
fr_fr: Ceci contrôle le titre que l'utilisateur voit lors du paiement.

source: Title
fr_fr: Titre

source: Enable EasyTransac payment
fr_fr: Activer les paiements via EasyTransac

source: Enable/Disable
fr_fr: Activer/Désactiver

source: Pay with your credit card.
fr_fr: Payez avec votre carte bancaire.

source: EasyTransac payment gateway for WooCommerce.
fr_fr: EasyTransac, plateforme de paiement pour WooCommerce.

source: Telephone number validation
fr_fr: Validation du numéro de téléphone

source: Notification wordpress magic quotes bugfix
fr_fr: Correction de Notification WordPress Magic Quotes

source: Other than unix environment support
fr_fr: Support autre que l'environnement Unix

source: EasyTransac SDK update to v1.0.11
fr_fr: Mise à jour du SDK EasyTransac à v1.0.11

source: New refunds possibilities
fr_fr: Nouvelle possibilité de remboursement

source: New subscriptions possibilities
fr_fr: Nouvelle possibilité d'abonnement

source: New debug mode for problem troubleshooting.
fr_fr: Nouveau mode debug pour déboguage.

source: EasyTransac SDK update to v1.0.10
fr_fr: Mise à jour du SDK EasyTransac à v1.0.10

source: HTTP notification issue fix for HTTP only websites.
fr_fr: Correctif de problème de notification HTTP pour les sites Web HTTP en uniquement.

source: WooCommerce v3 compatibility.
fr_fr: Compatibilité avec WooCommerce v3.

source: Works on WooCommerce v2.8 and v3+
fr_fr: Fonctionne sur WooCommerce v2.8 et v3+

source: OneClick can be disabled.
fr_fr: One Click peut être désactiver.

source: Installation Instructions
fr_fr: Instructions d'installation

source: You also get the key on this page that you need to paste on the WooCommerce payment gateway configuration page (Step 8).
fr_fr: Vous obtenez la clé sur cette page que vous devez coller sur la page de configuration de la passerelle de paiement WooCommerce (étape 8).

source: Create account on https://www.easytransac.com, then log in and got to 'Applications' and add a new application. On the application creation page, you'll have to give a name to the application that will allow you to filter the transactions if you have many uses of EasyTransac.
fr_fr: Créez un compte sur https://www.easytransac.com, ensuite connectez vous et allez à 'Applications' et ajoutez une nouvelle application. Sur la page de création d'application, vous devez donner un nom à votre application. Cela vous premettra de filtrer les transactions si vous utilisez EasyTransac pour plusieurs activités.

source: Please enter the IP address of your server hosting your e-commerce website in the allowed IP address section. In the notification URL enter your website's URI followed by '/wc-api/easytransac'. Example: http://yoursite.com/wc-api/easytransac
fr_fr: Veuillez entrer l'adresse IP du serveur hébergeant votre site Web de e-commerce dans la section adresses IP autorisées.Dans l'URL de notification, entrez l'adresse de votre site suivi de '/wc-api/easytransac'. Par example: http://yoursite.com/wc-api/easytransac

source: First of all, create an account on https://www.easytransac.com, then log in and got to 'Applications' and add a new application. On the application creation page, you'll have to give a name to the application that will allow you to filter the transactions if you have many uses of EasyTransac.
fr_fr: Tout d'abord, créez un compte sur https://www.easytransac.com, ensuite connectez vous et allez à 'Applications' et ajoutez une nouvelle application. Sur la page de création d'application, vous devez donner un nom à votre application. Cela vous premettra de filtrer les transactions si vous utilisez EasyTransac pour plusieurs activités.

source: Please check the following points in order to install this module:
fr_fr: Veuillez vérifier les points suivant dans l'ordre afin d'installer ce module:

source: Please check your phpinfo for the following requirements:
fr_fr: Veuillez vérifier votre phpinfo pour les pré-requis suivante:

source: Install the WooCommerce plugin or check it is enable if you already got it.
fr_fr: Installez le plugin WooCommerce ou vérifiez s'il est bien activé.

source: <strong>Requirements</strong>: PHP Curl extension and OpenSSL version 1.0.1 (visible in your phpinfo).
fr_fr: <strong>Pré-requis</strong>: Extension PHP Curl et OpenSSL version 1.0.1 (visible dans votre phpinfo).

source: <strong>Please read the installation guide before using this plugin and follow the steps in the FAQ to create your EasyTransac account.</strong>
fr_fr: <strong>Veuillez lire le guide d'installation avant d'utiliser ce plugin et suivez les étapes dans la FAQ pour créer votre compte EasyTransac</strong>

source: Easy payment solution for your Wordpress WooCommerce website:
fr_fr: Solution de paiement facile pour les sites Wordpress WooCommerce:

source: Configure the EasyTransac plugin by following the <strong>FAQ</strong> and the <strong>Installation guide</strong>
fr_fr: Configurez le plugin EasyTransac en suivant la <strong>FAQ</strong> et le <strong>guide d'installation</strong>

source: Create your EasyTransac account on <a href="https://www.easytransac.com">www.easytransac.com</a>
fr_fr: Créez votre compte EasyTransac sur <a href="https://www.easytransac.com">www.easytransac.com</a>

source: Download and install this plugin
fr_fr: Télécharger et installer ce plugin

source: Ensure you have the WooCommerce plugin enabled first
fr_fr: Assurez vous tout d'abord d'avoir le plugin WooCommerce activé

source: Check that your webserver has the minimum requirements (PHP Curl, OpenSSL 1.0.1)
fr_fr: Vérifiez que votre serveur web possède les minimums requis (PHP Curl, OpenSSL 1.0.1)

source: EasyTransac provides turnkey secure payment at very low charge rates
fr_fr: EasyTransac fournit un paiement sécurisé clé en main à des taux très bas

source: Accept all CB, VISA, and Mastercard payments in euro
fr_fr: Acceptez toutes les CB, Visa et Mastercard payés en euro

source: Easy install step by step
fr_fr: Installation facile étape par étape

source: See our website for <a href="https://www.easytransac.com/en/e-comerce">a complete list of our other E-comerce modules</a>
fr_fr: Visitez notre site pour <a href="https://www.easytransac.com/en/e-comerce">une liste complète de notre autres plugins de paiement</a>

source: Requirements
fr_fr: Pré-requis

source: You can chose the application type: 'Test' means that payments aren't real, whereas Live is for production use.
fr_fr: Vous pouvez choisir le type d'application: 'Test' cela signifie que les paiements ne sont pas réels, contrairement à une utilisation en production.

source: You also get the key on this page that you need to paste on the WooCommerce payment gateway configuration page (Installation-&gt;Step 3).
fr_fr: Vous obtenez la clé sur cette page que vous devez coller sur la page de configuration de la passerelle de paiement WooCommerce (Installation-&gt;Étape 3).

source: How to get my EasyTransac API Key?
fr_fr: Comment obtenir ma clé d'API EasyTransac.

source: Use the WooCommerce-&gt;Settings-&gt;Checkout-&gt;EasyTransac screen to configure your EasyTransac API key.
fr_fr: Utilisez l'écran de WooCommerce-&gt;Paramètres-&gt;Paiment-&gt;EasyTransac pour configurer la clé d'API.

source: Activate the plugin through the 'Plugins' screen in WordPress
fr_fr: Activez l'extension sur la page « Extensions » dans WordPress

source: Upload the plugin files to the <code>/wp-content/plugins/easytransac_woocommerce</code> directory, or install the plugin through the WordPress plugins screen directly.
fr_fr: Uploadez les fichier du plugin dans le dossier <code>/wp-content/plugins/easytransac_woocommerce</code>, ou installez le depuis la page de plugin Wordpress directement.

source: Easytransac SDK integration. New requirement : PHP &gt;= 5.5.
fr_fr: Intégration du SDK EasyTransac. Nouveaux pré-requis : PHP &gt;= 5.5.

source: Language of payment page is set.
fr_fr: Langue de la page de paiement à été définie.

source: OneClick payments.
fr_fr: Paiements OneClick.

source: Notification URL helper on settings page.
fr_fr: Assistant URL de notification sur la page de paramètres.

source: cURL fallback.
fr_fr: Retrait de cURL.

source: New logo.
fr_fr: Nouveau logo.

source: TLSv1.1 Fallback instead of TLSv1 which is not working correctly on certain systems.
fr_fr: TLSv1.1 plutôt TLSv1 qui ne fonctionne pas correctement sur certains systèmes.

source: Non-HTTPS websites hotfix.
fr_fr: HotFix pour les sites en Non-HTTPS.

source: Refund support removed: EasyTransac API doesn't support partial refund nor WooCommerce supports full refund only. Refund can still be done via the EasyTransac back office.
fr_fr: Possibilité de remboursement retirée: l'API EasyTransac ne supporte pas un remboursement partiel. Le remboursement peut toujours être fait depuis le BackOffice EasyTransac.

source: The cart is only emptied when the payment is completed.
fr_fr: Le panier est vidé uniquement quand le paiement est complété.

source: Cancel button redirects back to the cart.
fr_fr: Bouton d'annulation renvoie au panier.

source: Adds system requirements checks.
fr_fr: Ajout des pré-requis.

source: Support for non-HTTPS websites.
fr_fr: Support des sites non-HTTPS.

source: French translations.
fr_fr: Traduction française.

source: WooCommerce Payment Gateway.
fr_fr: Plateforme de paiement pour WooCommerce.
